// Информация об объектах
import Foundation

// =================================================================================
// =========================== Небольшое вступление ================================
// =================================================================================

// Обучение в формате игры или на примерах, связанных с играми, усваиваются большинством людей куда лучше,
// нежели попытки заставить их, учащихся, решать теоремы при помощи базовых операторов.
// Именно поэтому в данном пособии взята за основу игра Ragnarok Online или, точнее, открытая [база данных](http://ratemyserver.net) по всем монстрам и предметам игры.
// К концу первого курса каждый из вас будет знаком с основами языка Swift и создаст свою первую простейшую консольную игру.

//: >Привет

// =================================================================================
// =========================== Горячие клавиши =====================================
// =================================================================================

// Умение пользоваться "Горячими клавишами" является крайне необходимым в повседневной жизни любого прораммиста.
// Дабы не спугнуть ваш интерес к учёбе, ниже приводится набор базовых горячих клавиш,
// которые пригодятся вам в ходе обучения на первом курсе.

// Utilities: Alt + CMD + 0
// Панель утилит в правой части экрана.

// Navigator: CMD + 0
// Панель со списком файлов в левой части экрана.

// Dubug area: Shift + Cmd + Y
// Консоль в нижней части экрана.

// Закомментировать строку: Ctrl + /
// Поднять строку: Alt + Cmd + [
// Опустить строку: Alt + Cmd + ]
// Выровнять строки кода: Ctrl + i (можно перед этим выделить весь файл при помощи комбинации клавиш Crtl + A)

// =================================================================================
// =========================== Домашнее задание ====================================
// =================================================================================

// Попрактикуйтесь в использовании горячих клавиш
