//: [Назад](@previous)

import Foundation

//: ## Информация об объектах
/*:
 Xcode предоставляет множество полезных функций, делающих нашу жизнь проще.
 Одна из самых популярных из них - это система подсказок с информацией об объектах.
 Взгляните на пример ниже:
*/
/// Показатель уровня атаки
var Size = "Medium"

/*:
 Коментарий над объектом в формате трёх "слэшей" добавляет к объекту подсказку под ключом Description.
 Благодаря этой подсказке вы можете получить необходимую информацию об объекте в любом месте приложения, где бы он ни использовался.
*/
/*:
 Для этого необходимо просто зажать клавишу Alt и нажать на интереующий вас объект левой кнопкой мыши.
 Попробуйте произвести вышеуказанное действие над переменной Size и во всплывающем окне вы увидете заданное ранее описание объекта.
*/
/*:
 Так же описание любого выбранного (не обязательно его выделять, достаточно просто установить на обекте курсор) объекта можно увидеть в правом меню Xcode (Utilities) в рзаделе Quick Help (значок вопросительного знака).
 В дальнейшем, в ходе обучения, мы разберём более продвинутые техники написания подсказок для объектов, параметров и прочего.
*/
//: С наиболее полным списком вы можете ознакомиться в [данной](http://nshipster.com/swift-documentation/) статье.
//: ### Домашнее задание
//: Создайте пару-тройку объектов по примеру выше и напишите для них подсказки.

//: [Next](@next)
