//: [Previous](@previous)

import Foundation

// Отсюда и далее мы начнём во всю использовать всю мощь ООП (объектно-ориентированного программирования).

// В любом приложении всё состоит из объектов.
// Само приложение - ни что иное как объект состоящий из иных объектов.

// Что же такое Объект, спросите вы?
// Объект - это экземпляр Класса или Структуры. О классах мы повогорим на следующем уроке,
// а вот о Структураж ниже:

// =================================================================================
// =========================== Structure ===========================================
// =================================================================================

// Структура - это абстрактный тип данных, который может хранить в себе иные данные.
// В том числе и другие структуры.
// Если в двух словах, то: вы можете вынести определённый набор данных и поведения в отдельный объект
// и использовать его в любом месте приложения.

enum skillType {
  case passive, active, offensive
}

/// Наш тестовый монстр
struct Monster {
  let name: String = "Lava Golem"
  var monsterHP: Int = 24324
}

/// Наш герой
struct Player {
  let skills: (String, skillType) = ("Iron Hand", .passive)
  let heroAtk: Int = 777
  
  // В данном случае мы имеем действие что наносит определённый урон.
  // Так же стоит заметить, что мы передаём внутрь функции другую структуру по ссылке (inout)
  // Тем самым меняем сам передаваемый объект.
  /// Нанесение урона.
  /// - Parameter monster: Сам объект монстра
  /// - Parameter damage: Урон который наносит герой вышеуказанному монстру
  func takingDamage(monster: inout Monster, damage: Int) {
    monster.monsterHP -= damage
  }
}

var golem: Monster = Monster()
var player: Player = Player()

player.takingDamage(monster: &golem, damage: 11472)

// Как видите количество жизней у монстра уменьшилось.
golem.monsterHP

// =================================================================================
// =========================== Методы ==============================================
// =================================================================================

// =================================================================================
// =========================== Конструкуторы =======================================
// =================================================================================

print("\n===========\n")
// =================================================================================
// =========================== Домашнее задание ====================================
// =================================================================================

//: [Next](@next)
